10/data/attachments/64df4e90391130bd.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_2c1b31c5-c3fd-411f-bd6d-e929b1593c3f</nif:username>
            <nif:friendToBeAdded>Gabriel_them_Friend_7537_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>